<a href="https://colab.research.google.com/github/saishshinde15/PySpark_Codes/blob/main/Creation_Of_BasicDataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.3)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [8]:
from pyspark.sql import SparkSession

In [9]:
spark = SparkSession.builder.appName("DataFrameCreation").getOrCreate()

In [2]:
from pyspark.sql.types import StructType,StructField, StringType, IntegerType

In [3]:
data2 = [("Jack","","Eldridge","36636","M",90000),
    ("Matthew","J", "Munro","28832","M",45400),
    ("Sheila","Oway", "Roberts","12114","F",64000),
    ("Anne","", "Dushane","32192","F",141000),
    ("Jane","Rebecca","Jones","99482","F",56000)
  ]

## Method 1

In [13]:
schema = StructType([
    StructField("firstname",StringType(),True),
    StructField("middlename",StringType(),True),
    StructField("lastname",StringType(),True),
    StructField("id", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", IntegerType(), True)
  ])

In [14]:
df = spark.createDataFrame(data=data2,schema=schema)
df.printSchema()
df.show(truncate=False)

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+---------+----------+--------+-----+------+------+
|firstname|middlename|lastname|id   |gender|salary|
+---------+----------+--------+-----+------+------+
|Jack     |          |Eldridge|36636|M     |90000 |
|Matthew  |J         |Munro   |28832|M     |45400 |
|Sheila   |Oway      |Roberts |12114|F     |64000 |
|Anne     |          |Dushane |32192|F     |141000|
|Jane     |Rebecca   |Jones   |99482|F     |56000 |
+---------+----------+--------+-----+------+------+

## Method 2(using Data Definition Language (DDL))

In [15]:
schema_ddl = "firstname STRING, middlename STRING, lastname STRING, id STRING, gender STRING, salary INT "
df_with_ddl_schema = spark.createDataFrame(data=data2,schema=schema_ddl)
df.printSchema()
df.show(truncate=False)

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+---------+----------+--------+-----+------+------+
|firstname|middlename|lastname|id   |gender|salary|
+---------+----------+--------+-----+------+------+
|Jack     |          |Eldridge|36636|M     |90000 |
|Matthew  |J         |Munro   |28832|M     |45400 |
|Sheila   |Oway      |Roberts |12114|F     |64000 |
|Anne     |          |Dushane |32192|F     |141000|
|Jane     |Rebecca   |Jones   |99482|F     |56000 |
+---------+----------+--------+-----+------+------+

In [18]:
import pandas as pd
import numpy as np
import pyspark.pandas as ps
#from pyspark.sql import SparkSession

/usr/local/lib/python3.10/dist-packages/pyspark/pandas/__init__.py:50: UserWarning: 'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.
  warnings.warn(

In [19]:
series=ps.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
pandasdf=ps.DataFrame(
    {
        "a":[1,2,3],
        "b":[4,5,6],
        "c":[7,8,9],
        "d":["a","b","c"],
    },
    index=[1,2,3]
)
print(pandasdf)

   a  b  c  d
1  1  4  7  a
2  2  5  8  b
3  3  6  9  c

In [22]:
test=ps.DataFrame([
    ("Jack","","Eldridge","36636","M",90000),
    ("Matthew","J", "Munro","28832","M",45400),
    ("Sheila","Oway", "Roberts","12114","F",64000),
    ("Anne","", "Dushane","32192","F",141000),
    ("Jane","Rebecca","Jones","99482","F",56000)
  ])

In [23]:
print(test)

         0        1         2      3  4       5
0     Jack           Eldridge  36636  M   90000
1  Matthew        J     Munro  28832  M   45400
2   Sheila     Oway   Roberts  12114  F   64000
3     Anne            Dushane  32192  F  141000
4     Jane  Rebecca     Jones  99482  F   56000

In [24]:
test.dtypes

0    object
1    object
2    object
3    object
4    object
5     int64
dtype: object

In [25]:

print(test.to_markdown())

|    | 0       | 1       | 2        |     3 | 4   |      5 |
|---:|:--------|:--------|:---------|------:|:----|-------:|
|  0 | Jack    |         | Eldridge | 36636 | M   |  90000 |
|  1 | Matthew | J       | Munro    | 28832 | M   |  45400 |
|  2 | Sheila  | Oway    | Roberts  | 12114 | F   |  64000 |
|  3 | Anne    |         | Dushane  | 32192 | F   | 141000 |
|  4 | Jane    | Rebecca | Jones    | 99482 | F   |  56000 |